public class Main {
    public static void main(String[] args) {

        int totalAmount = 13676;
        int roublePerMile = 20;
        int bonusMiles = totalAmount / roublePerMile;

        System.out.println("Итоговое количество бонусных миль " + bonusMiles
        );

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}